ecommerce/app/controllers/new_arrivals_controller.rb

    def index
      @new_arrivals = NewArrival.all
---
SELECT "new_arrivals".* FROM "new_arrivals"